return {
	"goolord/alpha-nvim",
	-- dependencies = { 'nvim-mini/mini.icons' },
	config = function()
		local alpha = require("alpha")
		local dashboard = require("alpha.themes.dashboard")

		dashboard.section.header.val = {
			"                                                       ",
			" ███╗   ██╗███████╗ ██████╗ ██████╗  ██████╗  ██████╗  ",
			" ████╗  ██║██╔════╝██╔═══██╗██╔══██╗██╔═══██╗██╔════╝  ",
			" ██╔██╗ ██║█████╗  ██║   ██║██████╔╝██║   ██║██║  ███╗ ",
			" ██║╚██╗██║██╔══╝  ██║   ██║██╔══██╗██║   ██║██║   ██║ ",
			" ██║ ╚████║███████╗╚██████╔╝██████╔╝╚██████╔╝╚██████╔╝ ",
			" ╚═╝  ╚═══╝╚══════╝ ╚═════╝ ╚═════╝  ╚═════╝  ╚═════╝  ",
			"                                                       ",
		}

		dashboard.section.buttons.val = {
			dashboard.button("e", "   New file", ":ene <BAR> startinsert <CR>"),
			dashboard.button("f", "   Find file", ":Telescope find_files<CR>"),
			dashboard.button("s", "   Settings", ":e $MYVIMRC | :cd %:p:h | split . | wincmd k | pwd<CR>"),
			dashboard.button("q", "󰈆   Quit NVIM", ":qa<CR>"),
		}

		alpha.setup(dashboard.opts)
	end,
}
